<?xml version="1.0" ?>
<net name="yolov3" version="10">
	<layers>
		<layer id="0" name="scale_factor" type="Parameter" version="opset1">
			<data shape="1, 2" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="im_shape" type="Parameter" version="opset1">
			<data shape="1, 2" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="im_shape">
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="image" type="Parameter" version="opset1">
			<data shape="1, 3, 608, 608" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="image">
					<dim>1</dim>
					<dim>3</dim>
					<dim>608</dim>
					<dim>608</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Tile_0" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 19, 19" offset="0" size="1444"/>
			<output>
				<port id="0" precision="FP32" names="Tile_0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="BatchNormalization_0/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="32, 3, 3, 3" offset="1444" size="3456"/>
			<output>
				<port id="0" precision="FP32" names="conv2d_0.w_0">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Conv_0" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>608</dim>
					<dim>608</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>608</dim>
					<dim>608</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="data_add_17197" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="4900" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="BatchNormalization_0/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>608</dim>
					<dim>608</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="batch_norm_0.tmp_2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>608</dim>
					<dim>608</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="LeakyRelu_0/weights2585737287" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="5028" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="LeakyRelu_0" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>608</dim>
					<dim>608</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="leaky_relu_0.tmp_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>608</dim>
					<dim>608</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="BatchNormalization_1/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="64, 32, 3, 3" offset="5032" size="73728"/>
			<output>
				<port id="0" precision="FP32" names="conv2d_1.w_0">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Conv_1" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>608</dim>
					<dim>608</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>304</dim>
					<dim>304</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="data_add_1720017205" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="78760" size="256"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="BatchNormalization_1/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>304</dim>
					<dim>304</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="batch_norm_1.tmp_2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>304</dim>
					<dim>304</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="LeakyRelu_1/weights2583337173" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="5028" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="LeakyRelu_1" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>304</dim>
					<dim>304</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="leaky_relu_1.tmp_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>304</dim>
					<dim>304</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="BatchNormalization_2/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="32, 64, 1, 1" offset="79016" size="8192"/>
			<output>
				<port id="0" precision="FP32" names="conv2d_2.w_0">
					<dim>32</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Conv_2" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>304</dim>
					<dim>304</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>304</dim>
					<dim>304</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="data_add_1720817213" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="87208" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="BatchNormalization_2/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>304</dim>
					<dim>304</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="batch_norm_2.tmp_2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>304</dim>
					<dim>304</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="LeakyRelu_2/weights2595336468" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="5028" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="LeakyRelu_2" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>304</dim>
					<dim>304</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="leaky_relu_2.tmp_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>304</dim>
					<dim>304</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="BatchNormalization_3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="64, 32, 3, 3" offset="87336" size="73728"/>
			<output>
				<port id="0" precision="FP32" names="conv2d_3.w_0">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Conv_3" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>304</dim>
					<dim>304</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>304</dim>
					<dim>304</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="data_add_1721617221" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="161064" size="256"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="BatchNormalization_3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>304</dim>
					<dim>304</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="batch_norm_3.tmp_2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>304</dim>
					<dim>304</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="LeakyRelu_3/weights2609336528" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="5028" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="LeakyRelu_3" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>304</dim>
					<dim>304</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="leaky_relu_3.tmp_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>304</dim>
					<dim>304</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Add_0" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>304</dim>
					<dim>304</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>304</dim>
					<dim>304</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="elementwise_add_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>304</dim>
					<dim>304</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="BatchNormalization_4/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="128, 64, 3, 3" offset="161320" size="294912"/>
			<output>
				<port id="0" precision="FP32" names="conv2d_48.w_0">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Conv_4" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>304</dim>
					<dim>304</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="data_add_1722417229" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1, 1" offset="456232" size="512"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="BatchNormalization_4/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="batch_norm_4.tmp_2">
					<dim>1</dim>
					<dim>128</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="LeakyRelu_4/weights2606537164" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="5028" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="LeakyRelu_4" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="leaky_relu_4.tmp_0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="BatchNormalization_5/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="64, 128, 1, 1" offset="456744" size="32768"/>
			<output>
				<port id="0" precision="FP32" names="conv2d_4.w_0">
					<dim>64</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Conv_5" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="data_add_1723217237" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="489512" size="256"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="BatchNormalization_5/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="batch_norm_5.tmp_2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="LeakyRelu_5/weights2596136657" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="5028" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="LeakyRelu_5" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="leaky_relu_5.tmp_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="BatchNormalization_6/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="128, 64, 3, 3" offset="489768" size="294912"/>
			<output>
				<port id="0" precision="FP32" names="conv2d_5.w_0">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Conv_6" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="data_add_1724017245" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1, 1" offset="784680" size="512"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="BatchNormalization_6/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="batch_norm_6.tmp_2">
					<dim>1</dim>
					<dim>128</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="LeakyRelu_6/weights2592937299" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="5028" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="LeakyRelu_6" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="leaky_relu_6.tmp_0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="elementwise_add_1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="BatchNormalization_7/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="64, 128, 1, 1" offset="785192" size="32768"/>
			<output>
				<port id="0" precision="FP32" names="conv2d_6.w_0">
					<dim>64</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Conv_7" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="data_add_1724817253" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="817960" size="256"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="BatchNormalization_7/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="batch_norm_7.tmp_2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="LeakyRelu_7/weights2608537101" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="5028" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="LeakyRelu_7" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="leaky_relu_7.tmp_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="BatchNormalization_8/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="128, 64, 3, 3" offset="818216" size="294912"/>
			<output>
				<port id="0" precision="FP32" names="conv2d_7.w_0">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Conv_8" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="data_add_1725617261" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1, 1" offset="1113128" size="512"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="BatchNormalization_8/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="batch_norm_8.tmp_2">
					<dim>1</dim>
					<dim>128</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="LeakyRelu_8/weights2597736438" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="5028" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="LeakyRelu_8" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="leaky_relu_8.tmp_0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Add_2" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="elementwise_add_2">
					<dim>1</dim>
					<dim>128</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="BatchNormalization_9/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="256, 128, 3, 3" offset="1113640" size="1179648"/>
			<output>
				<port id="0" precision="FP32" names="conv2d_49.w_0">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Conv_9" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="data_add_1726417269" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 1, 1" offset="2293288" size="1024"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="BatchNormalization_9/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="batch_norm_9.tmp_2">
					<dim>1</dim>
					<dim>256</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="LeakyRelu_9/weights2599337212" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="5028" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="LeakyRelu_9" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="leaky_relu_9.tmp_0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="BatchNormalization_10/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="128, 256, 1, 1" offset="2294312" size="131072"/>
			<output>
				<port id="0" precision="FP32" names="conv2d_8.w_0">
					<dim>128</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="Conv_10" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="data_add_1727217277" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1, 1" offset="2425384" size="512"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="BatchNormalization_10/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="batch_norm_10.tmp_2">
					<dim>1</dim>
					<dim>128</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="LeakyRelu_10/weights2598937002" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="5028" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="LeakyRelu_10" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="leaky_relu_10.tmp_0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="BatchNormalization_11/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="256, 128, 3, 3" offset="2425896" size="1179648"/>
			<output>
				<port id="0" precision="FP32" names="conv2d_9.w_0">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Conv_11" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="data_add_1728017285" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 1, 1" offset="3605544" size="1024"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="BatchNormalization_11/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="batch_norm_11.tmp_2">
					<dim>1</dim>
					<dim>256</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="LeakyRelu_11/weights2611336738" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="5028" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="LeakyRelu_11" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="leaky_relu_11.tmp_0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Add_3" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="elementwise_add_3">
					<dim>1</dim>
					<dim>256</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="BatchNormalization_12/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="128, 256, 1, 1" offset="3606568" size="131072"/>
			<output>
				<port id="0" precision="FP32" names="conv2d_10.w_0">
					<dim>128</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Conv_12" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="data_add_1728817293" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1, 1" offset="3737640" size="512"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="BatchNormalization_12/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="batch_norm_12.tmp_2">
					<dim>1</dim>
					<dim>128</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="LeakyRelu_12/weights2601336609" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="5028" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="LeakyRelu_12" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="leaky_relu_12.tmp_0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="BatchNormalization_13/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="256, 128, 3, 3" offset="3738152" size="1179648"/>
			<output>
				<port id="0" precision="FP32" names="conv2d_11.w_0">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Conv_13" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="data_add_1729617301" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 1, 1" offset="4917800" size="1024"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="BatchNormalization_13/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="batch_norm_13.tmp_2">
					<dim>1</dim>
					<dim>256</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="LeakyRelu_13/weights2610937464" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="5028" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="LeakyRelu_13" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="leaky_relu_13.tmp_0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Add_4" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="elementwise_add_4">
					<dim>1</dim>
					<dim>256</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="BatchNormalization_14/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="128, 256, 1, 1" offset="4918824" size="131072"/>
			<output>
				<port id="0" precision="FP32" names="conv2d_12.w_0">
					<dim>128</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Conv_14" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="data_add_1730417309" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1, 1" offset="5049896" size="512"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="BatchNormalization_14/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="batch_norm_14.tmp_2">
					<dim>1</dim>
					<dim>128</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="LeakyRelu_14/weights2597337188" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="5028" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="LeakyRelu_14" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="leaky_relu_14.tmp_0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="BatchNormalization_15/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="256, 128, 3, 3" offset="5050408" size="1179648"/>
			<output>
				<port id="0" precision="FP32" names="conv2d_13.w_0">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="Conv_15" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="data_add_1731217317" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 1, 1" offset="6230056" size="1024"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="BatchNormalization_15/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="batch_norm_15.tmp_2">
					<dim>1</dim>
					<dim>256</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="LeakyRelu_15/weights2605736990" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="5028" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="LeakyRelu_15" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="leaky_relu_15.tmp_0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="Add_5" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="elementwise_add_5">
					<dim>1</dim>
					<dim>256</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="BatchNormalization_16/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="128, 256, 1, 1" offset="6231080" size="131072"/>
			<output>
				<port id="0" precision="FP32" names="conv2d_14.w_0">
					<dim>128</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="Conv_16" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="data_add_1732017325" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1, 1" offset="6362152" size="512"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="BatchNormalization_16/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="batch_norm_16.tmp_2">
					<dim>1</dim>
					<dim>128</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="LeakyRelu_16/weights2610536456" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="5028" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="LeakyRelu_16" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="leaky_relu_16.tmp_0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="BatchNormalization_17/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="256, 128, 3, 3" offset="6362664" size="1179648"/>
			<output>
				<port id="0" precision="FP32" names="conv2d_15.w_0">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="Conv_17" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="data_add_1732817333" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 1, 1" offset="7542312" size="1024"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="BatchNormalization_17/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="batch_norm_17.tmp_2">
					<dim>1</dim>
					<dim>256</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="LeakyRelu_17/weights2600137560" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="5028" size="4"/>
